class PromptBuilder:
    @staticmethod
    def simplePrompt():
        return (
            "Згенеруй 5 карток для вивчення англійської мови. Слова формату C1-C2"
            "Переклад тільки одним словом."
            "Використовуй найрідкісніші слова з усього англійського словника подібного рівня слів."
            "Поверни ТІЛЬКИ чистий JSON-масив без жодного додаткового тексту, "
            "пояснень чи Markdown-форматування. "
            "Структура: [{'question': 'word', 'answer': 'переклад'}, ...]"
        )
